In [17]:
import pandas as pd

In [18]:
datos = pd.Series([10,20,30,40,50])

In [19]:
print (datos)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [20]:
datos_df = pd.DataFrame({
    "Nombre": ["Juan", "Ana", "Jose", "Arturo"],
    "Edad": [25, 30, 35, 40],
    "Pais": ["MX", "CO", "AR", "BR"]
})

print(datos_df)

   Nombre  Edad Pais
0    Juan    25   MX
1     Ana    30   CO
2    Jose    35   AR
3  Arturo    40   BR

In [21]:
print(datos_df["Nombre"][1])

Ana

In [22]:
print(datos_df["Nombre"])

0      Juan
1       Ana
2      Jose
3    Arturo
Name: Nombre, dtype: object

In [23]:
print(datos_df.loc[1])
print(datos_df.iloc[1])

Nombre    Ana
Edad       30
Pais       CO
Name: 1, dtype: object
Nombre    Ana
Edad       30
Pais       CO
Name: 1, dtype: object

In [24]:
# Seleccionar filas por etiqueta
print(datos_df.loc[0])  # Selecciona la primera fila
print(datos_df.loc[0:2])

Nombre    Juan
Edad        25
Pais        MX
Name: 0, dtype: object
  Nombre  Edad Pais
0   Juan    25   MX
1    Ana    30   CO
2   Jose    35   AR

In [25]:
# Seleccionar filas por etiqueta
print(datos_df.loc[0])  # Selecciona la primera fila
print(datos_df.loc[0:2])

Nombre    Juan
Edad        25
Pais        MX
Name: 0, dtype: object
  Nombre  Edad Pais
0   Juan    25   MX
1    Ana    30   CO
2   Jose    35   AR

In [26]:
print(datos_df.loc[0, 'Nombre'])  # Selecciona el valor en la primera fila y la columna 'Nombre'
print(datos_df.loc[:, ['Nombre', 'Pais']])  # Selecciona todas las filas pero solo las columnas 'Nombre' y 'Ciudad'

Juan
   Nombre Pais
0    Juan   MX
1     Ana   CO
2    Jose   AR
3  Arturo   BR

In [27]:
mydf = pd.DataFrame({
    'Name': ['Juan', 'Ana', 'Jose', 'Arturo', 'Maria'],
    'Age': [42,25,64,30,45],
    'Country': ['MX', 'CO', 'AR', 'BR', 'MX']
})

print(mydf['Age'])

0    42
1    25
2    64
3    30
4    45
Name: Age, dtype: int64

In [28]:
filter = mydf['Age'] > 30
print(filter)
print(mydf[filter])

0     True
1    False
2     True
3    False
4     True
Name: Age, dtype: bool
    Name  Age Country
0   Juan   42      MX
2   Jose   64      AR
4  Maria   45      MX

In [29]:
mydf['Salary'] = [1000, 2000, 1500, 1800, 2500]  # Nueva columna con sueldos
print(mydf)

     Name  Age Country  Salary
0    Juan   42      MX    1000
1     Ana   25      CO    2000
2    Jose   64      AR    1500
3  Arturo   30      BR    1800
4   Maria   45      MX    2500

In [30]:
mydf.drop(columns=['Salary'])
print(mydf)

     Name  Age Country  Salary
0    Juan   42      MX    1000
1     Ana   25      CO    2000
2    Jose   64      AR    1500
3  Arturo   30      BR    1800
4   Maria   45      MX    2500